src/InformationRegisters/РезультатАнализаИнформационныхБаз/РезультатАнализаИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатАнализаИнформационныхБаз</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПроведенияАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьСтатус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусИнформационнойБазы/СтатусИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусИнформационнойБазы</name>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РезультатАнализаИнформационныхБаз/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.НеИзменятьСтатус Тогда
			НаборЗаписей = РегистрыСведений.СтатусИнформационнойБазы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(Запись.ИнформационнаяБаза);
			ЗаписьСтатус = НаборЗаписей.Добавить();
			ЗаписьСтатус.ИнформационнаяБаза = Запись.ИнформационнаяБаза;
			ЗаписьСтатус.Статус = Запись.Статус;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
